ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/*******************************************************************************
* \file cy_ble_stack_host_main.h
* \version 2.0
*
* \brief
*  This file contains declarations of public BLE APIs other than those covered by
*  GAP, GATT, and L2CAP specific APIs. Also specified are the defines, constants,
*  and data structures required for the APIs.
* 
* Related Document:
*  BLE Standard Spec - CoreV4.2, CSS, CSAs, ESR05, ESR06
* 
********************************************************************************
* \copyright
* Copyright 2014-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef CY_BLE_STACK_HOST_MAIN_H_
#define CY_BLE_STACK_HOST_MAIN_H_


/***************************************
* Common stack includes
***************************************/
#include "BLE_config.h"
#include "cy_ble_stack.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/***************************************
** Constants
***************************************/
/** Bluetooth Stack busy status */
#define CY_BLE_STACK_STATE_BUSY                  (0x01u) /**< stack busy status */
#define CY_BLE_STACK_STATE_FREE                  (0x00u) /**< stack free status */

/***************************************
**  Memory pool configuration data defines
***************************************/
/** Maximum number of Connections */
#define CY_BLE_MAX_CONNECTION_INSTANCES          (0x04u)

/** Size of the heap when GATT MTU, L2CAP MTU, and MPS sizes are specified as 23 Bytes */
/** An extra 256 bytes is added as we allocate eight chunks of 32 bytes in the buffer pool and
   64 u bytes is the overhead required by mint buf management to store each extra chunk ( 8 chunks * 8 bytes overhead).
   4 bytes of default memory for AES engine, 40u bytes for SMP-AES engine  */ 
#define CY_BLE_DEFAULT_HOST_RAM_SIZE             (16u + 1024u + 824u + 120u + 256u + 64u +4u +40u)

/** L2CAP Header size */
#define CY_BLE_L2CAP_HDR_SZ                      (0x04u)

/** Buffer size needed for L2cap PSM  */
#define CY_BLE_L2CAP_PSM_SIZE                    (0x28u) 
/** Buffer size needed for L2cap CBFC channels */
#define CY_BLE_L2CAP_CBFC_CHANNEL_SIZE           (0x20u)

/** Minimum stack queue depth requirement per connection */
/** The application can choose to give higher queue depth for better throughput. */
#define CY_BLE_L2CAP_STACK_Q_DEPTH_PER_CONN       (0x06u)
/** 
 * L2cap Queue element size specifies the size of single element to hold L2CAP data.
 * The application must provide memory based on the number of queue elements required per connection.
 * Ex: if the application needs a stack queue size of five elements per connection and supports four connections,
 * then the application must provide memory as per the following calculation
 * Memory = CY_BLE_L2CAP_QUEUE_ELEMENT_SIZE * CY_BLE_L2CAP_STACK_Q_DEPTH_PER_CONN * 4;
 */ 
#define CY_BLE_L2CAP_QUEUE_ELEMENT_SIZE           (0x18u)

/**
 * L2cap per connection heap requirement. This memory includes memory for L2cap per connection context alone
 */
#define CY_BLE_RAM_SIZE_L2CAP_SINGLE_CONN             (0x90u)

/**
 * HCI per connecton heap requirement . This memory include memory for Hci remote device structure(8 bytes) and hci command queue 
 * with depth of 6 per connection(0x30 bytes).
 */
#define CY_BLE_RAM_SIZE_HCI_SINGLE_CONN              (0x38u) 
 
 /**
  * GAP module per connection heap requirement 
  */
#define CY_BLE_RAM_SIZE_GAP_SINGLE_CONN              (0x04u)
 
 /**
  * GATT and ATT module per connection heap requirement 
  */
#define CY_BLE_RAM_SIZE_GATT_SINGLE_CONN             (0x104u)  
 
 /**
  * AES module per connection heap requirement 
  */
#define CY_BLE_RAM_SIZE_AES_SINGLE_CONN             (0x08u)  
 
 /**
  * SMP module per connection heap requirement includes memory for SMP Context and
  * SMP platform context
  */
#define CY_BLE_RAM_SIZE_SMP_SINGLE_CONN              (0x132u)   

/**
 *  Device queue heap requirement per connection. This requirement includes Device Queue and Device queue extension RPA
 */
 #define CY_BLE_RAM_SIZE_DEVICE_Q_SINGLE_CONN         (CY_BLE_STACK_ONE_DEVICE_Q_ENTITY_SIZE + CY_BLE_STACK_DEVICE_Q_EXTN_RPA_SIZE )
 
/**
 * Host per connection heap requirement . Application needs to provide memory as per following calculation 
 *  = (CY_BLE_HOST_PER_CONN_HEAP_REQ * CY_BLE_MAX_CONNECTION_INSTANCES)
 */
#define CY_BLE_RAM_SIZE_HOST_SINGLE_CONN             (CY_BLE_RAM_SIZE_HCI_SINGLE_CONN \
                                                      +  CY_BLE_RAM_SIZE_L2CAP_SINGLE_CONN \
                                                      +  CY_BLE_RAM_SIZE_GAP_SINGLE_CONN \
                                                      +  CY_BLE_RAM_SIZE_GATT_SINGLE_CONN \
                                                      +  CY_BLE_RAM_SIZE_AES_SINGLE_CONN \
                                                      +  CY_BLE_RAM_SIZE_SMP_SINGLE_CONN \
                                                      +  CY_BLE_STACK_ONE_BONDED_DEVICE_SIZE \
                                                      +  CY_BLE_RAM_SIZE_DEVICE_Q_SINGLE_CONN)

/** Size of the heap required for Secure connection feature
 * This includes memory for SMP FSM, SMP Crypto tool box, and ECC
 */
#define CY_BLE_RAM_SIZE_SECURE_SINGLE_CONN        (0x3B0u) /**< SC single connection */
/** SC multiconnection */
#define CY_BLE_RAM_SIZE_SECURE_CONNECTIONS        (CY_BLE_MAX_CONNECTION_INSTANCES * CY_BLE_RAM_SIZE_SECURE_SINGLE_CONN)

/** Data Buffer Pool identifiers to support configurable parameters for L2CAP and
 * GATT in the BLE Stack
 * These data buffer pools must be configured during BLE Stack
 * initialization. */

/** Data Buffer index for ATT/GATT Configured MTU Size */
#define CY_BLE_STACK_APP_POOL_1_SZ                (0x00u)

/** Data Buffer index for L2CAP configuration for number of PSM Channels
 * */
#define CY_BLE_STACK_APP_POOL_2_SZ                (0x01u)

/** Data Buffer index for L2CAP configuration for number of CBFC Channels
 * */
#define CY_BLE_STACK_APP_POOL_3_SZ                (0x02u)

/** Data Buffer index for L2CAP configured MTU Size */
#define CY_BLE_STACK_APP_POOL_4_SZ                (0x03u)

/** Maximum Application Pool  */
#define CY_BLE_STACK_APP_MIN_POOL                 (CY_BLE_STACK_APP_POOL_4_SZ + 1u)

/** GATT minimum attribute length */
#define CY_BLE_GATT_MAX_ATTR_LEN_MIN_VAL          (0x00u)

/** GATT minimum attribute length buffers*/
#define CY_BLE_GATT_MIN_NO_OF_ATT_MTU_BUFF        (0x03u)

/** Max attribute size can be of 0xFFFF but the Stack has a limitation
 * on buffer creation as it requires an additional eight bytes and 
 * L2CAP header size (four bytes)
 * */
#define CY_BLE_GATT_MAX_ATTR_LEN_MAX_VAL          (0xFFD0u)

/** L2CAP MTU minimum value */
#define CY_BLE_L2CAP_MTU_MIN_VALUE                (0x17u)

/** Max L2CAP MTU or MPS size can be of 0xFFFF, but the Stack has a limitation
 * on buffer creation as it requires an additional eight bytes and 
 * L2CAP header size (four bytes)
 * */
#define CY_BLE_L2CAP_MTU_MAX_VALUE                (0xFFD0u)

