ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/** L2CAP MPS minimum value */
#define CY_BLE_L2CAP_MPS_MIN_VALUE                CY_BLE_L2CAP_MTU_MIN_VALUE

/** L2CAP MPS maximum value */
#define CY_BLE_L2CAP_MPS_MAX_VALUE                CY_BLE_L2CAP_MTU_MAX_VALUE

/** Default Bonded device size */
#define CY_BLE_GAP_DEFAULT_BONDED_DEVICE_SIZE     (0x10u)

/** Size of single bonded device entry*/
#define CY_BLE_STACK_ONE_BONDED_DEVICE_SIZE       (0xA8u)

/** Size of internal device queue */

#define CY_BLE_STACK_DEVICE_Q_EXTN_RPA_SIZE       (0x1Cu)

/** Size of internal device queue */

#define CY_BLE_STACK_ONE_DEVICE_Q_ENTITY_SIZE    (0x10u)

/** Size of the checksum to be stored in Flash memory  */
#define CY_BLE_STACK_CHECKSUM_SIZE                    (0x2u)

/**  Flash size is configurable by component; configuration is mentioned below.
    * \#define CY_BLE_STACK_FLASH_STORAGE_SIZE       CY_BLE_STACK_CHECKSUM_SIZE + (total memory required for 
    * flash storage based on below calculation)
    *
    * Bonded device list memory computation
    * CY_BLE_GAP_DEFAULT_BONDED_DEVICE_SIZE:
    *       It is a user-configured value for the size of bondlist using BLE PDL
    * Memory required =
    *((CY_BLE_STACK_ONE_BONDED_DEVICE_SIZE * User configured bondlist size)
    *                                        + (CY_BLE_STACK_ONE_DEVICE_Q_ENTITY_SIZE *  User configured bondlist size))
    *
    * Whitelist list memory computation 
    * CY_BLE_MAX_WHITELIST_LIST_SZ: 
    *       It is a user-configured value for the size of whitelist using the BLE PDL.
    *       Range: 1 to 16.
    * Memory required =
    * (((CY_BLE_LL_ONE_WHITELIST_HEAP_REQ * CY_BLE_MAX_WHITELIST_LIST_SZ) +
    *                                           CY_BLE_LL_WHITELIST_RETENTION_HEAP_REQ)
    *
    * Resolving list memory computation 
    * CY_BLE_MAX_RESOLVABLE_DEVICES: 
    *       It is a user-configured value for the size of resolving list using the BLE PDL.
    *       Range: 1 to 16, 0 if Privacy 1.2 feature is not used.
    * Memory required =
    * (((CY_BLE_LL_PRIVACY_HEAP_REQ * CY_BLE_MAX_RESOLVABLE_DEVICES) +
    *                                         CY_BLE_LL_PRIVACY_RETENTION_HEAP_REQ)
    */

/** Encryption information */
/** encryption data size */
#define CY_BLE_ENCRYPTION_DATA_SIZE              (0x10u) 
/** encryption key size */
#define CY_BLE_ENCRYPTION_KEY_SIZE               (0x10u) 
/** encryption nonce size */
#define CY_BLE_ENCRYPTION_NONCE_SIZE             (0x0Du) 
/** BLE MIC size */
#define CY_BLE_MIC_SIZE                          (0x04u) 

/** SMP Key size */
#define CY_BLE_IRK_SIZE                          (0x10u)

/** Bitmask values for Flash write */
#define CY_BLE_PERSISTENT_BOND_LIST_BITMASK      (0x01u) /**< Bondlist mask */
#define CY_BLE_PERSISTENT_RPA_LIST_BITMASK       (0x02u) /**< Resolvablelist mask */
#define CY_BLE_PERSISTENT_WHITELIST_BITMASK      (0x04u) /**< whiteList mask */

/** Application to provide or free memory */
#define CY_BLE_ALLOC_MEMORY                      (0x00u) /**< Allocate memory */
#define CY_BLE_FREE_MEMORY                       (0x01u) /**< Free memory */

/***************************************
** Enumerated Types
***************************************/
/**
 \addtogroup group_ble_common_api_definitions
 @{
*/

/** Timeout happened reason due to stack started times or application stated timers. 
    It is the application's responsibility to disconnect or keep the channel on depending on type of timeout;
    i.e., GATT procedure timeout: the application may choose to disconnect.*/
typedef enum
{
    /** Advertisement time set by application has expired */
    CY_BLE_GAP_ADV_TO = 0x01u,
    
    /** Scan time set by application has expired */
    CY_BLE_GAP_SCAN_TO,

    /** GATT procedure timeout */
    CY_BLE_GATT_RSP_TO,

    /** Application procedure timeout */
    CY_BLE_GENERIC_APP_TO
    
}cy_en_ble_to_reason_code_t;

/** BLE Stack memory request type */
typedef enum
{
    /** Memory requested for prepare write request */
    CY_BLE_PREPARED_WRITE_REQUEST = 0x00u,

    /** Invalid request */
    CY_BLE_INVALID_REQUEST
        
}cy_en_ble_protocol_req_t;

/** Phy used for the connection */
typedef enum
{
    /** The transmitter PHY for the connection is LE 1M */
    CY_BLE_PHY_MASK_LE_1M = 0x01u,

    /** The transmitter PHY for the connection is LE 2M */
    CY_BLE_PHY_MASK_LE_2M,

    /** The transmitter PHY for the connection is LE Coded */
    CY_BLE_PHY_MASK_LE_CODED

}cy_en_ble_phy_mask_t;


/** PHY preference masks used for Cy_BLE_SetPhy API. */
typedef enum
{
    /** All PHY settings are preferred by the host */
    CY_BLE_PHY_NO_PREF_MASK_NONE = 0x00u,

    /** Host has no preference for TX PHY */
    CY_BLE_PHY_NO_PREF_MASK_TX,

    /** Host has no preference for RX PHY */
    CY_BLE_PHY_NO_PREF_MASK_RX,
    
    /** Host has no preference for both TX & RX PHY */
    CY_BLE_PHY_NO_PREF_MASK_BOTH_TX_RX

}cy_en_ble_phy_no_pref_mask_t;


/** Privacy modes used for Cy_BLE_SetPrivacyMode API. */
typedef enum
{
    /* Network privacy mode */
    CY_BLE_PRIVACY_MODE_NETWORK = 0x00u,
    /* Device privacy mode */
    CY_BLE_PRIVACY_MODE_DEVICE,
}cy_en_ble_privacy_mode_t;



/***************************************
** Exported structures and unions
***************************************/

/** callback function prototype to receive DTM packet from Controller */
typedef uint16_t (*cy_ble_hci_rx_cb_t)(uint8_t type, uint8_t  * packet, uint8_t length);


/** Bluetooth Device Addresses */
typedef struct
{
    /** Public Bluetooth device address of size 6 bytes */
    uint8_t     *publicBdAddr;

    /** Private Bluetooth device address of size 6 bytes */
    uint8_t     *privateBdAddr;
}cy_stc_ble_bd_addrs_t;

/** Connection Handle */
typedef struct
{
    /** Identifies the peer device(s) bonded or in current connection. The Stack supports
       CY_BLE_GAP_MAX_BONDED_DEVICE+CY_BLE_MAX_CONNECTION_INSTANCES devices.
       first device connected is assigned a value (CY_BLE_GAP_MAX_BONDED_DEVICE
       +CY_BLE_MAX_CONNECTION_INSTANCES)-1. If one device is present in the bonded list, 
       then the current device will be assigned the value
       (CY_BLE_GAP_MAX_BONDED_DEVICE+CY_BLE_MAX_CONNECTION_INSTANCES)-2,
       else (CY_BLE_GAP_MAX_BONDED_DEVICE+CY_BLE_MAX_CONNECTION_INSTANCES)-1.
    */
    uint8_t           bdHandle;

    /** Identifies the active ATT connection Instance.
    */
    uint8_t           attId;

}cy_stc_ble_conn_handle_t;

/** Store BLE Application Data parameter into flash */
typedef struct
{
    /** BIT field to specify the type of list to be stored in flash
      * CY_BLE_PERSISTENT_BOND_LIST_BITMASK  - B0 Bond List Data
      * CY_BLE_PERSISTENT_RPA_LIST_BITMASK   - B1 Resolving List Data
      * CY_BLE_PERSISTENT_WHITELIST_BITMASK  - B2 Whitelist Data
      * Bit B3 is internally used by the stack and other bits are reserved for
      * future use.
      */
    uint8_t     bitField;
} cy_stc_ble_stack_flash_param_t;

/** Timer parameter */
typedef struct
{
    /** Handle of the started timer */
    uint8_t    timerHandle;
    
    /** Timeout for which timer to be started
      * IF MSBit of timeout == 1, then resolution is in milliseconds,
      * ELSE resolution is seconds.
      * This takes the assumption that no one would call timeout of,
      * say, 32000 seconds.
      */
    uint8_t    timeout;

} cy_stc_ble_timer_info_t;

/**
 * Configuration structure for enabling selective features 
 * and passing associated parameters in BLE Stack.
 */
typedef struct
{
    /** Seed for DRBG */
    uint32_t      seed;

}cy_stc_ble_stack_random_num_param_t;

/** Tx power level configuration parameters */
typedef struct
{
    /** Channel group ID for which power level is to be read/written */
    cy_en_ble_bless_phy_ch_grp_id_t     bleSsChId;

    /** Device handle for which power level is to be read/written */
    uint8_t                           bdHandle;

