ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
} cy_stc_ble_tx_pwr_config_param_t;

/** Tx power level parameter */
typedef struct
{
    /** Power level */
    cy_en_ble_bless_pwr_lvl_t           blePwrLevel;

    /** Tx power level configuration parameters */
    cy_stc_ble_tx_pwr_config_param_t     pwrConfigParam;

} cy_stc_ble_tx_pwr_lvl_info_t;

/** RSSI parameter */
typedef struct
{
    /** The RSSI value 
            Range is -85 <= N <= 5 in dBm */
    int8_t      rssi; 

    /** Peer device handle */
    uint8_t     bdHandle;
    
}cy_stc_ble_rssi_info_t;

/** AES encrypt information */
typedef struct
{
    /** data containing plain text (128-bit) that is to be encrypted */
    uint8_t   plainData[CY_BLE_ENCRYPTION_DATA_SIZE];

    /** Pointer to the AES Key (128-bit) that is to be used for AES encryption*/
    uint8_t   aesKey[CY_BLE_ENCRYPTION_KEY_SIZE];
    
}cy_stc_ble_aes_encrypt_info_t;

/** AES CCM encrypt information */
typedef struct
{
    /** array of bytes holding the key */
    uint8_t   key[CY_BLE_ENCRYPTION_KEY_SIZE];

    /** array of bytes */
    uint8_t   nonce[CY_BLE_ENCRYPTION_NONCE_SIZE];

    /** Pointer to an array of bytes to be encrypted. The size of the array should be equal to 
          the value of the 'length' parameter*/
    uint8_t   *data;

    /** length of data */
    uint8_t   length;
    
}cy_stc_ble_aes_ccm_encrypt_info_t;

/** AES CCM decrypt information */
typedef struct
{
    /** array of bytes holding the key */
    uint8_t   key[CY_BLE_ENCRYPTION_KEY_SIZE];

    /** array of bytes */
    uint8_t   nonce[CY_BLE_ENCRYPTION_NONCE_SIZE];

    /** Pointer to an array of bytes to be encrypted. Size of the array should be equal to 
          the value of the 'length' parameter*/
    uint8_t   * data;
    
    /** Pointer to an array of bytes (four Bytes) to provide the MIC value
          generated during encryption */
    uint8_t   * mic;

    /** length of data */
    uint8_t   length;
    
}cy_stc_ble_aes_ccm_decrypt_info_t;

/** authentication payload information */
typedef struct
{
    /** authentication timeout value */
    uint16_t      authPayloadTimeout;

    /** peer device handle */
    uint8_t       bdHandle;
    
}cy_stc_ble_auth_payload_info_t;

/** Slave Latency Parameters */
typedef struct
{
    /** Set or reset the force quick transmit configuration in the BLE Stack.
         '1': Set the quick transmit behavior. It gets set immediately and disables
        over the air slave latency. This quick transmit setting remains true until
        the application gives control to the BLE Stack for controlling the quick transmit bit.
        '0': Reset the force quick transmit behavior in BLESS to allow the BLE Stack to control
        quick transmit behavior when slave latency is applied. */
    uint8_t   setForceQuickTransmit;
    
    /** remote device identifier */
    uint8_t   bdHandle;
    
}cy_stc_ble_slave_latency_info_t;

/** DLE Set Data Length parameter */
typedef struct
{
    /** Peer bdHandle */
    uint8_t       bdHandle;

    /** The maximum number of payload octets in a Link Layer Data Channel
     * PDU that the local Controller will send on the current connection.
     */
    uint16_t      connMaxTxOctets;

    /** The maximum time that the local Controller will take to send a Link
     * Layer Data Channel PDU on the current connection. 
     */
    uint16_t      connMaxTxTime;

    /** The maximum number of payload octets in a Link Layer Data Channel
     * PDU that the local Controller will receive on the current connection.
     */
    uint16_t      connMaxRxOctets;

    /** The maximum time that the local Controller will take to receive a Link
     * Layer Data Channel PDU on the current connection.
     */
    uint16_t      connMaxRxTime;

}cy_stc_ble_set_data_length_info_t;

/** DLE Suggested Data Length parameter */
typedef struct
{
    /** Controller's maximum transmitted number of payload 
     * octets to be used for new connections.
     */
    uint16_t      suggestedTxOctets;

    /** Controller's maximum packet transmission time to be 
     * used for new connections. 
     */
    uint16_t      suggestedTxTime;

}cy_stc_ble_suggested_data_length_info_t;

/** Channel Map Parameters Information  */
typedef struct 
{
    /** Peer bdHandle */
    uint8_t       bdHandle;

    /** This parameter contains five octet byte stream (Least Significant
              Byte having the bit fields 0 to 7, most significant byte having
              the bit fields 32 to 36). The nth such field (in the range 0 to
              36) contains the value for the link layer channel index n. 
              Allowed values and their interpretation are,
              * Channel 'n' is bad = 0x00u
              * Channel 'n' is unknown = 0x01u
              The most significant bits (37 to 39) are reserved and will be 
              set to 0. At least one channel will be marked as unknown. 
                 For example-
                 expected pattern = XX XX XX XX 1F
                 not expected =  XX XX XX XX 10, XX XX XX XX 2f 
                 MSB 3 bits should be not set. (1F is most significant byte in this case) */
    uint8_t       * channelMap;      

}cy_stc_ble_channel_map_info_t;

/** Resolving list information of one device */
typedef struct
{
    /** Peer IRK */
    uint8_t       peerIrk[CY_BLE_IRK_SIZE];

    /** Local IRK */
    uint8_t       localIrk[CY_BLE_IRK_SIZE];

    /** Peer Identity device address  */
    uint8_t       bdAddr[CY_BLE_BD_ADDR_SIZE];

    /** Peer Identity addr type */
    uint8_t       type; /*public = 0, Random = 1*/

}cy_stc_ble_resolving_device_info_t;

/** Configuration Structure for Set Privacy Mode */
typedef struct
{
    /** Peer Identity device address  */
    uint8_t       bdAddr[CY_BLE_BD_ADDR_SIZE];

    /** Peer Identity addr type */
    uint8_t       type; /*public = 0, Random = 1*/

    /** Privacy Mode */
    cy_en_ble_privacy_mode_t privacyMode;

}cy_stc_ble_privacy_mode_info_t;


/** Random number generated from the Stack */
typedef struct
{
    /** public = 0, Random = 1 */
    uint8_t     type;

