ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
    /** Bluetooth device address */
    uint8_t     bdAddr[CY_BLE_BD_ADDR_SIZE];

}cy_stc_ble_peer_id_addr_t;

/** Random number generated from the Stack */
typedef struct
{
    /** standard HCI command/data packet */
    uint8_t       * data;

    /** length of data */
    uint16_t      dataLength;

    /** HCI packet type*/
    uint8_t       packetType;

}cy_stc_ble_hci_tx_packet_info_t;

/** Set Phy parameter */
typedef struct
{
    /** Peer bdHandle */
    uint8_t                    bdHandle;

    /** Host preference for PHY setting. Non preferred PHY settings are ignored by the controller */
    cy_en_ble_phy_no_pref_mask_t allPhyMask;

    /** The transmitter PHY for the connection */
    cy_en_ble_phy_mask_t         txPhyMask;

    /** The receiver PHY for the connection */
    cy_en_ble_phy_mask_t         rxPhyMask;

    /** Parameter to specify coding preference*/
    uint16_t                   phyOption;

}cy_stc_ble_set_phy_info_t;

/** Set Default Phy parameter */
typedef struct
{
    /** Host preference for PHY setting. Non preferred PHY settings are ignored by the controller */
    cy_en_ble_phy_no_pref_mask_t    allPhyMask;

    /** The transmitter PHY for the connection */
    cy_en_ble_phy_mask_t    txPhyMask;

    /** The receiver PHY for the connection */
    cy_en_ble_phy_mask_t    rxPhyMask;

}cy_stc_ble_set_suggested_phy_info_t;

/* --------------------------Structure corresponding to events-------------------- */

/** Local suggested or Max 'tx octets' and 'tx time' */
typedef struct
{
    /** Controller's maximum transmitted number of payload 
     * octets to be used for new connections
     */
    uint16_t      suggestedTxOctets;

    /** Controller's maximum packet transmission time to be 
     * used for new connections.
     */
    uint16_t      suggestedTxTime;

    /** Maximum number of payload octets that the local Controller supports
     * for transmission of a single Link Layer Data Channel PDU.
     */
    uint16_t      maxTxOctets;

    /** Maximum time, in microseconds, that the local Controller supports for
     * transmission of a single Link Layer Data Channel PDU. 
     */
    uint16_t      maxTxTime;

    /** Maximum number of payload octets that the local Controller supports
     * for reception of a single Link Layer Data Channel PDU.
     */
    uint16_t      maxRxOctets;

    /** Maximum time, in microseconds, that the local Controller supports for
     * reception of a single Link Layer Data Channel PDU. 
     */
    uint16_t      maxRxTime;

}cy_stc_ble_data_length_param_t;

/** LE Data Length Change event parameter */
typedef struct
{
    /** The maximum number of payload octets in a Link Layer Data Channel
     * PDU that the local Controller will send on the current connection.
     */
    uint16_t      connMaxTxOctets;

    /** The maximum time that the local Controller will take to send a Link
     * Layer Data Channel PDU on the current connection.
     */
    uint16_t      connMaxTxTime;

    /** The maximum number of payload octets in a Link Layer Data Channel
     * PDU that the local controller expects to receive on the current connection.
     */
    uint16_t      connMaxRxOctets;

    /** The maximum time that the local Controller expects to take to receive a
     * Link Layer Data Channel PDU on this connection. 
     */
    uint16_t      connMaxRxTime;
    
    /** Peer bdHandle */
    uint8_t       bdHandle;

}cy_stc_ble_data_length_change_event_param_t;


/** Memory request parameters */
typedef struct
{
    /** Protocol Request type*/
    cy_en_ble_protocol_req_t    request;

    /** This is an output parameter that the application must fill and pass to the BLE Stack as per below table:
    
         request                        | memory                             
         ------------                   | ------------  
         CY_BLE_PREPARED_WRITE_REQUEST   | cy_stc_ble_prepare_write_request_memory_t
    */
    void                    * configMemory;

    /** The event parameter is generated to allocate memory or to free up previously allocated memory
            CY_BLE_ALLOC_MEMORY (0) = to allocate memory for request type, 
            CY_BLE_FREE_MEMORY (1) = free previously allocated memory for the request type*/
    uint8_t                   allocFree;

    /** Connection handle */
    cy_stc_ble_conn_handle_t     connHandle; 

} cy_stc_ble_memory_request_t;

/** AES CCM encrypted data information */
typedef struct
{
    /** MIC value generated during encryption */
    uint8_t   mic[CY_BLE_MIC_SIZE];

    /** Pointer to an array of size 'length' where the encrypted/decrypted data
            is stored */
    uint8_t   *data;

    /** length of data */
    uint8_t   length;
    
}cy_stc_ble_aes_ccm_param_t;

/** Timeout event parameter */
typedef struct
{
    /** Bluetooth device address */
    cy_en_ble_to_reason_code_t      reasonCode;

    /** handle */
    union
    {
        /** Connection Handle */
        cy_stc_ble_conn_handle_t     connHandle;

        /* Peer device handle */
        uint8_t                   bdHandle;

    }CY_BLE_HANDLE;

    /** Handle of the started timer */
    uint8_t                       timerHandle;

}cy_stc_ble_timeout_param_t;

/** Generic Event parameter structure */
typedef struct
{
    /** HCI error code as defined in Bluetooth 4.1 core specification, Volume 2,
             Part D, section 1.3  */
    uint8_t   status;

    /** Event Parameter associated to event */
    void    *eventParams;
    
}cy_stc_ble_events_param_generic_t;

/** Set Phy parameter */
typedef struct
{
    /** Peer bdHandle */
    uint8_t               bdHandle;

    /** The transmitter PHY for the connection */
    cy_en_ble_phy_mask_t    txPhyMask;

    /** The receiver PHY for the connection */
    cy_en_ble_phy_mask_t    rxPhyMask;

}cy_stc_ble_phy_param_t;

/** LL control procedure param structure */
typedef struct
{
    /** Peer bdHandle */
    uint8_t bdHandle;

    /** LL Control procedure status - TRUE/FALSE */
    uint8_t cntrlProcStatus;
    
}cy_stc_ble_ll_cntrl_proc_param_t;

/** Whitelist information param */
typedef struct
{
    /** Peer ID Address type, public = 0, Random = 1 */
    uint8_t type;
    
