ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
    /** Peer ID Address */
    uint8_t bdAddr[CY_BLE_BD_ADDR_SIZE];
    
} cy_stc_ble_white_list_t;

/** Whitelist retention structure */
typedef struct
{
    /** Size of the Whitelist */
    uint8_t size;

    /** Pointer to Whitelist Array */ 
    const cy_stc_ble_white_list_t  *whiteList;
    
} cy_stc_ble_white_list_retention_t ;

/** Resolving list information param */
typedef struct
{
    /** Internally used by the Stack */
    uint16_t flags;

    /** Internally used by the Stack */    
    uint16_t extendedFlags;
    
    /** Peer ID Address */
    uint8_t bdAddr[CY_BLE_BD_ADDR_SIZE];
    
    /** Peer ID Address type, public = 0, Random = 1 */
    uint8_t type;
    
    /** Local IRK */
    uint8_t localIrk[CY_BLE_IRK_SIZE];
    
    /** Peer IRK */
    uint8_t peerIrk[CY_BLE_IRK_SIZE];
    
}cy_stc_ble_rpa_list_info_t;

/** Resolving list retention structure */
typedef struct
{
    /** Size of Resolving List */
    uint8_t size;

    /** Pointer to Resolving List Array */
    cy_stc_ble_rpa_list_info_t *resolvingList;
    
}cy_stc_ble_resolving_list_retention_t;
/** @} */

/***************************************
** Exported APIs
***************************************/
/**
 \addtogroup group_ble_common_api_functions
 @{
*/

/******************************************************************************
* Function Name: Cy_BLE_StoreStackData
***************************************************************************//**
* 
*  This function instructs the Stack to backup the Stack internal RAM data into flash.
*  This API must be called by the application to back up Stack data. If this API is not 
*  called appropriately, the Stack internal data structure will not be available on the 
*  power cycle.
*     
*  \param param: Parameter is of type 'cy_stc_ble_stack_flash_param_t'.
*   
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or 
*  failed. Following are the possible error codes.
*
*  Errors codes                              | Description
*  ------------                              | -----------
*   CY_BLE_SUCCESS                           | On successful operation.
*   CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS      | Flash write in progress, application needs to  call Cy_BLE_StoreStackData to complete the operation.
*   CY_BLE_ERROR_FLASH_WRITE                 | Error in flash Write. 
*   CY_BLE_ERROR_INVALID_PARAMETER           | If param pointer is NULL.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_StoreStackData
(
    cy_stc_ble_stack_flash_param_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_StartTimer 
***************************************************************************//**
* 
*  This function provides a timer start utility to the BLE-Component. The BLE-Component can
*  use this timer for certain operations like deferring writing CCCD to flash.
*  This function should not be used for generic purposes as the timer ticks are
*  updated only when there are LL activities. The BLE stack internally takes care of the 
*  timing requirement for GATT, GAP, and L2CAP signaling on-going procedures.
*  Maximum timer support for application is restricted to 4.
*
*  \param param: parameter of type 'cy_stc_ble_timer_info_t'
*  param->timerHandle: output parameter.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                              | Description
*   ------------                             | -----------
*   CY_BLE_SUCCESS                           | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER           | Timeout is set to zero.   
*   CY_BLE_ERROR_INVALID_OPERATION           | On failed operation.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_StartTimer
(
    cy_stc_ble_timer_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_StopTimer 
***************************************************************************//**
* 
*  This function provides a timer stop utility to the BLE-Component. The BLE-Component can  
*  use this timer for certain operations like deferring writing CCCD to flash.  
*  This function should not be used for generic purposes as the timer ticks are  
*  updated only when there are LL activities. The BLE stack internally takes care of the 
*  timing requirement for GATT, GAP, and L2CAP signaling on-going procedures.
* 
*  \param param: parameter of type 'cy_stc_ble_timer_info_t'
*   param->timeout: to be ignored.
*  param->timerHandle: input parameter.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                              | Description
*   ------------                             | -----------
*   CY_BLE_SUCCESS                           | On successful operation.
*   CY_BLE_ERROR_INVALID_OPERATION           | On failed operation (Timer is already stopped or expired).
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_StopTimer
(
    cy_stc_ble_timer_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GetRssi
***************************************************************************//**
* 
*  This function reads the recorded Received Signal Strength Indicator (RSSI) 
*  value for the last successfully received packet from the BLE radio 
*  sub-system. 
*  RSSI value is informed thorough 'CY_BLE_EVT_GET_RSSI_COMPLETE'
*     
*  \param param: Parameter is of type 'cy_stc_ble_rssi_info_t'
*   param->rssi: ignore this parameter
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                              | Description
*   ------------                             | -----------
*   CY_BLE_SUCCESS                           | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER           | On specifying NULL as input parameter.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY            | If connection does not exists for corresponding 'bdHandle'.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED    | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES      | If Stack resources are unavailable.
*
*   Information     | Description
*   -----------     | -----------
*   Range           | -85 <= N <= 5
*   \note: The value is in dBm.
*     
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetRssi
(
    cy_stc_ble_rssi_info_t  * param
);


