ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_GetTxPowerLevel
***************************************************************************//**
* 
*  This function reads the transmit power of the BLE radio for the given BLE
*  sub-system channel group. 
* 
*  Tx power level is informed thorough 'CY_BLE_EVT_GET_TX_PWR_COMPLETE'
*
*  \param param: Pointer to a variable of type 'cy_stc_ble_tx_pwr_config_param_t' where, 
*                * cy_stc_ble_tx_pwr_config_param_t -> bleSsChId indicates Channel group for which
*                  power level is to be read. The value can be advertisement
*                  channels (CY_BLE_LL_ADV_CH_TYPE) or data channels 
*                  (CY_BLE_LL_CONN_CH_TYPE).
*                * bdHandle indicates peer device handle. This is not applicable for advertisement
*                  channels (CY_BLE_LL_ADV_CH_TYPE).
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*    Errors codes                          | Description
*    ------------                          | -----------
*    CY_BLE_SUCCESS                        | On successful operation.
*    CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.  
*    CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exists for corresponding 'bdHandle'.
*    CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*    CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetTxPowerLevel
(
    cy_stc_ble_tx_pwr_config_param_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_SetTxPowerLevel
***************************************************************************//**
* 
*  This function sets the transmit power of the BLE radio for the given BLE
*  sub-system channel group.
*  Successful operation is informed through 'CY_BLE_EVT_SET_TX_PWR_COMPLETE' event.
*
* \param param: Parameter is of type 'cy_stc_ble_tx_pwr_lvl_info_t' where,
*                * blePwrLevel indicates Output Power level to be set by the function.
*                * cy_stc_ble_tx_pwr_config_param_t -> bleSsChId indicates Channel group for which
*                  power level is to be set. The value can be advertisement
*                  channels (CY_BLE_LL_ADV_CH_TYPE) or data channels 
*                  (CY_BLE_LL_CONN_CH_TYPE).
*                * cy_stc_ble_tx_pwr_config_param_t -> bdHandle indicates peer device handle. This
*                  is not applicable for advertisement channels (CY_BLE_LL_ADV_CH_TYPE). Set bdHandle to 0xFFu 
*                  to use 'blePwrLevel' as the default power level for all connections.
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*    Errors codes                          | Description
*    ------------                          | -----------
*    CY_BLE_SUCCESS                        | On successful operation.
*    CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*    CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exists for corresponding 'bdHandle'.
*    CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*    CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetTxPowerLevel
(
    cy_stc_ble_tx_pwr_lvl_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GetBleClockCfgParam
***************************************************************************//**
* 
*  This function reads the clock configuration parameter of the BLE sub-system. 
*  This is not a blocking function. Clock config paramter is informed through 
*  the 'CY_BLE_EVT_GET_CLK_CONFIG_COMPLETE' event.
* 
*  The following parameters related to the BLE sub-system clock are read by this
*  function:
* 
*  __Sleep Clock accuracy__

*   Sleep clock accuracy (SCA) in PPM. This parameter indicates the sleep clock
*   accuracy in PPM as described in the following table. It is set in the BLE
*   Stack and is used for BLE Connection operation while creating LE connection
*   with the peer device.
* 
*     Sleep Clock Accuracy Enum Field       | PPM Range Translation (PPM)
*     -------------------------------       | ---------------------------
*     CY_BLE_LL_SCA_251_TO_500_PPM          | 251 - 500
*     CY_BLE_LL_SCA_151_TO_250_PPM          | 151 - 250
*     CY_BLE_LL_SCA_101_TO_150_PPM          | 101 - 150
*     CY_BLE_LL_SCA_076_TO_100_PPM          | 76 - 100
*     CY_BLE_LL_SCA_051_TO_075_PPM          | 51 - 75
*     CY_BLE_LL_SCA_031_TO_050_PPM          | 31 - 50
*     CY_BLE_LL_SCA_021_TO_030_PPM          | 21 - 30
*     CY_BLE_LL_SCA_000_TO_020_PPM          |  0 - 20
* 
*   Refer to Bluetooth Core Specification 4.1 Volume 6, Chapter 4.5.7 for more
*   details on how the SCA is used.
* 
*  __Link Layer clock divider__

*   This input decides the frequency of the clock to the link layer. A lower
*   clock frequency results in lower power consumption. Default clock frequency
*   for the operation is 24 MHz. BLESS supports 24 MHz, 12 MHz, and 8 MHz clock
*   configurations. Based on the end application requirement (how frequent the 
*   communication is expected to be), this parameter must be set.
* 
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*    Errors codes                          | Description
*    ------------                          | -----------
*    CY_BLE_SUCCESS                        | On successful operation.
*    CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*    CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.

******************************************************************************/   
cy_en_ble_api_result_t Cy_BLE_GetBleClockCfgParam
(
    void
);


