ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_SetBleClockCfgParam
***************************************************************************//**
* 
*   
*  This function sets the clock configuration parameter of the BLE sub-system. This
*  is a blocking function. 
*  Successful operation is informed through event 'CY_BLE_EVT_SET_CLK_CONFIG_COMPLETE'.
*  The following parameters related to the BLE sub-system clock are set by this
*  function:
* 
*  __Sleep Clock accuracy__

*   Sleep clock accuracy (SCA) in PPM. This parameter indicates the sleep clock
*   accuracy in PPM as described in the following table. It is set in the BLE
*   Stack and is used for BLE Connection operation while creating LE connection
*   with the peer device.
*
*     Sleep Clock Accuracy Enum Field       | PPM Range Translation (PPM)
*     -------------------------------       | ---------------------------
*     CY_BLE_LL_SCA_251_TO_500_PPM          | 251 - 500
*     CY_BLE_LL_SCA_151_TO_250_PPM          | 151 - 250
*     CY_BLE_LL_SCA_101_TO_150_PPM          | 101 - 150
*     CY_BLE_LL_SCA_076_TO_100_PPM          | 76 - 100
*     CY_BLE_LL_SCA_051_TO_075_PPM          | 51 - 75
*     CY_BLE_LL_SCA_031_TO_050_PPM          | 31 - 50
*     CY_BLE_LL_SCA_021_TO_030_PPM          | 21 - 30
*     CY_BLE_LL_SCA_000_TO_020_PPM          |  0 - 20
* 
*   Refer to Bluetooth Core Specification 4.1 Volume 6, Chapter 4.5.7 for more
*   details on how the SCA is used.
* 
*  __Link Layer clock divider__

*   This input decides the frequency of the clock to the link layer. A lower
*   clock frequency results in lower power consumption. Default clock frequency
*   for the operation is 24 MHz. BLESS supports 24 MHz, 12 MHz, and 8 MHz clock
*   configurations. Based on the end application requirement (how frequent the 
*   communication is expected to be), this parameter must be set.
*
*  \param param: Pointer to a variable of type cy_stc_ble_bless_clk_cfg_params_t
*                     from which the existing clock configuration is taken.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*    Errors codes                          | Description
*    ------------                          | -----------
*    CY_BLE_SUCCESS                        | On successful operation.
*    CY_BLE_ERROR_INVALID_PARAMETER        | If param pointer is NULL
*    CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*    CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.

*   
******************************************************************************/ 
cy_en_ble_api_result_t Cy_BLE_SetBleClockCfgParam
(
    cy_stc_ble_bless_clk_cfg_params_t  * param
); 

/******************************************************************************
* Function Name: Cy_BLE_GenerateRandomNumber
***************************************************************************//**
* 
* This function sets the application-specific seed for DRBG (Deterministic Random number generator). 
* This function generates 8-byte random number that complies with pseudo random
*  number generation in accordance with [FIPS PUB 140-2]. Random number
*  generation function is used during security procedures documented in Bluetooth
*  4.1 core specification, Volume 3, Part H. 
*  
*  Generated random number is informed through event 'CY_BLE_EVT_RANDOM_NUM_GEN_COMPLETE'
*
* \param param: parameter is of type 'cy_stc_ble_stack_random_num_param_t'
*  param->seed: Seed for DRBG. Setting the seed to zero is functionally 
*               equivalent to not setting the application-specific seed.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*    Errors codes                          | Description
*    ------------                          | -----------
*    CY_BLE_SUCCESS                        | On successful operation.
*    CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*    CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
* 
******************************************************************************/ 
cy_en_ble_api_result_t Cy_BLE_GenerateRandomNumber
(
    cy_stc_ble_stack_random_num_param_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_AesEncrypt
***************************************************************************//**
* 
*  This function uses BLE sub-system AES engine to encrypt 128-bit of plain text
*  using the given AES key. The output of AES processing is copied to 
*  encryptedData buffer. Refer to Bluetooth 4.1 core specification, Volume 3,
*  Part H, section 2.2 for more details on usage of AES key.
* 
*  Completion of the API is informed through  event 'CY_BLE_EVT_AES_ENCRYPT_COMPLETE'
* 
*  \param param: Parameter of type 'cy_stc_ble_aes_encrypt_info_t'.
*   param->plainData: Pointer to the data containing plain text (128-bit) that is to be encrypted.
* 
*   param->aesKey: Pointer to the AES Key (128-bit) that is to be used for AES encryption.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
* 
*    Errors codes                               | Description
*    ------------                               | -----------
*    CY_BLE_SUCCESS                             | On successful operation.
*    CY_BLE_ERROR_INVALID_PARAMETER             | On specifying NULL as input parameter.
*    CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED      | If Memory allocation failed.
*    CY_BLE_ERROR_INSUFFICIENT_RESOURCES        | AES engine is being used internally or stack resources are unavailable.
* 
******************************************************************************/ 
cy_en_ble_api_result_t Cy_BLE_AesEncrypt
(   
    cy_stc_ble_aes_encrypt_info_t  * param
);   

