ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_AesCcmEncrypt
***************************************************************************//**
* 
*  This function encrypts the given data. 
* 
*  Encrypted data is informed through event 'CY_BLE_EVT_AES_CCM_ENCRYPT_COMPLETE'
*
* \param param: Parameter is of type 'cy_stc_ble_aes_ccm_encrypt_info_t ' 
* 
*  \return
*  cy_en_ble_api_result_t: Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          |   Description
*   ------------                          |   -----------
*   CY_BLE_SUCCESS                        |   On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        |   One of the inputs is a null pointer. 
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED |   If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   |   If Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AesCcmEncrypt
(
    cy_stc_ble_aes_ccm_encrypt_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_AesCcmDecrypt
***************************************************************************//**
* 
*  This function decrypts the given data.
* 
*  Decrypted data is informed through event 'CY_BLE_EVT_AES_CCM_DECRYPT_COMPLETE'
*
* \param param: Parameter is of type 'cy_stc_ble_aes_ccm_decrypt_info_t ' 
* 
* \return
*  cy_en_ble_api_result_t: Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                            | Description
*  ------------                           | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | One of the inputs is a NULL pointer.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AesCcmDecrypt
(
    cy_stc_ble_aes_ccm_decrypt_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_GenerateAesCmac
***************************************************************************//**
* 
*  This API enables the application to generate the AES CMAC of 16 bytes,
*  for a given variable length message and CMAC Key.
* 
*  After this API call, if the return value is CY_BLE_SUCCESS,
*  then CY_BLE_EVT_AES_CMAC_GEN_COMPLETE event indicates completion of cmac generation.
*  Check the output parameter cmac to get the generated cmac value after completion of CMAC generation.
*
* \param cmacGenParam: Parameter is of type 'cy_stc_ble_aes_cmac_generate_param_t ' 
* 
* \return
*  cy_en_ble_api_result_t: Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                     | Description
*  ------------                    | -----------
*   CY_BLE_SUCCESS                 | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER | One of the inputs is a NULL pointer, the 'buffer' can be NULL only if 'size' is zero.
*   CY_BLE_ERROR_INVALID_OPERATION | Application has already initiated AES CMAC operation that is pending completion.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GenerateAesCmac
(
    cy_stc_ble_aes_cmac_generate_param_t *cmacGenParam
);


/******************************************************************************
* Function Name: Cy_BLE_WriteAuthPayloadTimeout
***************************************************************************//**
* 
*  This function sets the Authentication Payload timeout in the BLE Controller for
*  LE_PING feature. Refer to Bluetooth 4.1 core specification, Volume 6, Part B,
*  section 4.6.5 for LE Ping operation.
*
*  The 'CY_BLE_EVT_WRITE_AUTH_PAYLOAD_TO_COMPLETE' event is triggered on successful setting of the Authentication Payload timeout in BLE Controller for
*  LE_PING feature.
*  
*  The 'CY_BLE_EVT_LE_PING_AUTH_TIMEOUT' event is triggered if the peer device has not responded
*  with the valid MIC packet within the application configured ping authentication time.
*     
* \param param: Parameter is of type 'cy_stc_ble_auth_payload_info_t ' 
*  param->bdHandle: Peer device handle.
*  param->authPayloadTimeout: Variable containing authentication timeout value to be
*                      written to the BLE Controller. Details on this parameter are
*                      as given below:
*                      - Value Range = 0x0001 to 0xFFFF
*                      - Default Value (N) = 3000 (30 seconds)
*                      - Time Calculation = N x 10 ms
*                      - Time Range = 10 ms to 655,350 ms
* 
* \return
*  cy_en_ble_api_result_t: Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exists for corresponding 'bdHandle'.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_WriteAuthPayloadTimeout
(
    cy_stc_ble_auth_payload_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_ReadAuthPayloadTimeout
***************************************************************************//**
* 
*  This function reads the Authentication Payload timeout set in the BLE Controller
*  for LE_PING feature. Refer to Bluetooth 4.1 core specification, Volume 6, Part B,
*  section 4.6.5 for LE Ping operation.
* 
*  Timeout is informed through event 'CY_BLE_EVT_READ_AUTH_PAYLOAD_TO_COMPLETE'
*
* \param param: Parameter is of type 'cy_stc_ble_auth_payload_info_t ' 
*  param->bdHandle: Peer device handle.
*  param->authPayloadTimeout: to be ignored.
* 
* \return
*  cy_en_ble_api_result_t: Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exists for corresponding 'bdHandle'.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ReadAuthPayloadTimeout
(
    cy_stc_ble_auth_payload_info_t  * param
);


