ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_SetSlaveLatencyMode
***************************************************************************//**
*
* This function overrides the default BLE Stack behavior for the LE connection that
* is established with non zero slave latency. This API can be used by the application
* to force set quick transmission for a link related to a specified 'bdHandle' during the
* slave latency period. 
* 
* If the force quick transmit option is selected, the device will always respond to
* all the Connection Events (CE) ignoring the slave latency. To re-enable the BLE Stack
* control quick transmit behavior, the application should call this API with force 
* quick transmit option set to zero.
*
* BLE Stack Control Policy: The BLE Stack enables quick transmission whenever any
* data packet is queued in the link layer. Upon successful transmission of a data packet, the
* BLE Stack resets the quick transmit to enable latency for power save.
*
* The BLE Stack also enables quick transmit whenever any real time LL Control PDU
* is received. After the acknowledgement of the PDU is processed, the quick transmit
* option is reset.
*
*  Command completion is informed through event 'CY_BLE_EVT_SET_SLAVE_LATENCY_MODE_COMPLETE'
*
* \param param: parameter is of type 'cy_stc_ble_slave_latency_info_t'
*
* \return
* cy_en_ble_api_result_t: Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exists for corresponding 'bdHandle'.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetSlaveLatencyMode
(
    cy_stc_ble_slave_latency_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_SetDataLength
***************************************************************************//**
*
* This API allows the application to suggest maximum transmission packet size and maximum packet transmission time 
* for the current connection. 
* This is a non-blocking function. Successful setting of controller operation is 
* informed through 'CY_BLE_EVT_SET_DATA_LENGTH_COMPLETE'.
* Actual data length used by controller will be informed through the 'CY_BLE_EVT_DATA_LENGTH_CHANGE' event.
*
*  \param param: parameter is of type 'cy_stc_ble_set_data_length_info_t'.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exists for corresponding 'bdHandle'.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.                                    
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetDataLength
(
    const cy_stc_ble_set_data_length_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_SetSuggestedDataLength
***************************************************************************//**
*
* This API allows the application to specify its preferred values for the Link 
* Layer maximum Tx packet (Data Channel PDU) size (connInitialMaxTxOctets) and 
* maximum Tx packet transmission time (connInitialMaxTxTime) to be used for new 
* connections. 
* This is a non-blocking function. Successful setting of controller operation is 
* informed through 'CY_BLE_EVT_SET_SUGGESTED_DATA_LENGTH_COMPLETE'.
* Actual data length used by controller will be informed through the 'CY_BLE_EVT_DATA_LENGTH_CHANGE' event.
*
*  \param param: parameter is of type 'cy_stc_ble_suggested_data_length_info_t'.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for input parameter.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable. 
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetSuggestedDataLength
(
    const cy_stc_ble_suggested_data_length_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GetDataLength
***************************************************************************//**
*
* This API allows the application to read the suggested and maximum Tx/Rx packet size and
* suggested and maximum Tx/Rx time that the BLE Stack uses. 
*
* This is a non-blocking function. 
* Current data length parameters are informed through 'CY_BLE_EVT_GET_DATA_LENGTH_COMPLETE'
*
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable. 
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetDataLength
(
    void
);


