ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_SetAddressResolutionEnable
***************************************************************************//**
*
* This API is used to enable resolution of Resolvable Private Addresses in the BLE Stack. This causes the
* BLE Stack to use the resolving list whenever the Controller receives a local or peer Resolvable Private Address.
*
* This is a non-blocking function. 
* Request complete is informed through 'CY_BLE_EVT_SET_RPA_ENABLE_COMPLETE'
*
*  \param param: 0x00 - Address Resolution in controller disabled (default) \n
*                        0x01 - Address Resolution in controller enabled \n
*                        0x02 - 0xFF Reserved for Future Use
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetAddressResolutionEnable
(
    uint8_t       param
);


/******************************************************************************
* Function Name: Cy_BLE_GetResolvingList
***************************************************************************//**
*
* This API is used to get resolving list. 
* This API is a blocking call. Hence no event will be generated.
*
*  \param param: Pointer to store the base address of resolving list.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Error codes                           | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for input parameter.
*  CY_BLE_ERROR_INVALID_OPERATION        | If privacy feature is not enabled.
*
* Note : The resolving list memory will be used by the stack. Hence the application 
*        should not modify the contents using the pointer provided by the stack.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetResolvingList(cy_stc_ble_resolving_list_retention_t const **param);


/******************************************************************************
* Function Name: Cy_BLE_SetPrivacyMode
***************************************************************************//**
*
* This API is used to allow the Host to specify the privacy mode to be used for 
* a given entry on the Resolving List. 

* The effect of this setting is specified in [Vol 6] Part B, Section 4.7.
*
* When an entry on the Resolving List is removed, the mode associated with that
* entry shall also be removed.

* This is not a blocking function. 
* Successful operation will be informed through 'CY_BLE_EVT_SET_PRIVACY_MODE_COMPLETE'.

*
*  \param privacyModeInfo: Buffer that contains the information of peer address, peer address type,
                    and privacy mode.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Error codes                           | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for input parameter.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
*
******************************************************************************/

cy_en_ble_api_result_t Cy_BLE_SetPrivacyMode
(
    cy_stc_ble_privacy_mode_info_t *privacyModeInfo
);


/******************************************************************************
* Function Name: Cy_BLE_SetLeEventMask
***************************************************************************//**
*
* This API is equivalent of the LE_Set_Event_Mask HCI command
* and is used to control which LE events are generated by the HCI for the Host.
* The host will process these events and will send appropriate events to the application.
* If the bit in the hciLeEventMask is set to a one, then the event 
* associated with that bit will be enabled. The Host must
* deal with each event that is generated by an LE Controller. The event mask
* allows the application to control which events will be generated for the host.
*
* This is not a blocking function. 
* Successful operation will be informed through 'CY_BLE_EVT_LE_SET_EVENT_MASK_COMPLETE'.
*
* \param param: Pointer to the LE Mask of size 8 bytes.
*         Refer Core Spec, Vol2, Part E, 7.8.1 for further information.
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetLeEventMask
(
    const uint8_t * param
);


/******************************************************************************
* Function Name: Cy_BLE_GetChannelMap
***************************************************************************//**
* 
* This function reads the channel map for data channels. This
* classification persists until it is overwritten by a subsequent call to this
* function or the controller is reset. If this command is used, updates should
* be sent within 10 seconds of the BLE Host knowing that the channel
* classification has changed. The interval between two successive commands sent
* will be at least one second. This command will be used only when the local
* device supports the Master role. 
* *
* This is not a blocking function. Successful operation is informed through 'CY_BLE_EVT_GET_CHANNEL_MAP_COMPLETE'
*
*  \param param: Pointer to security information of the device of type 
*             cy_stc_ble_channel_map_info_t. 
*   param->channelMap: To be ignored. 
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exists for corresponding 'bdHandle'.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetChannelMap
(
    cy_stc_ble_channel_map_info_t  * param
);

