ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_SetHostChannelClassification
***************************************************************************//**
* 
*  This function sets channel classification for data channels. This
*  classification persists until it is overwritten by a subsequent call to this
*  function or the controller is reset. If this command is used, updates should
*  be sent within 10 seconds of the BLE Host knowing that the channel
*  classification has changed. The interval between two successive commands sent
*  will be at least one second. This command will be used only when the local
*  device supports the Master role. 
*  
*  For details, refer to Bluetooth core specification 4.1, Volume 2, part E,
*  section 7.8.19.
* 
*  This is a non blocking function. Successful operation is informed through 
*  event 'CY_BLE_EVT_SET_HOST_CHANNEL_COMPLETE'
* 
*  \param param: Pointer of type cy_stc_ble_channel_map_info_t. 
*   param->bdHandle: To be ignored.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetHostChannelClassification
(
    cy_stc_ble_channel_map_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_AddDeviceToWhiteList
***************************************************************************//**
* 
*  This function adds the device to the Whitelist. The maximum number of devices that
*  can be added to the Whitelist is eight including CY_BLE_GAP_MAX_BONDED_DEVICE.
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part C, section 9.3.5 for more details on whitelist.
* 
*  Completion of operation is informed through 'CY_BLE_EVT_ADD_DEVICE_TO_WHITE_LIST_COMPLETE' event.
*  Successful operation triggers 'CY_BLE_EVT_PENDING_FLASH_WRITE' event
*
*  \param param: Peer device address of type cy_stc_ble_bd_addr_t.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                           | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for 'param' or bdAddr 'type' has an invalid value.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_AddDeviceToWhiteList
(
    cy_stc_ble_bd_addr_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_RemoveDeviceFromWhiteList
***************************************************************************//**
* 
*  This function removes the device from the Whitelist.
* 
*  Completion of operation is informed through the 'CY_BLE_EVT_REMOVE_DEVICE_FROM_WHITE_LIST_COMPLETE' event.
*  Completion operation triggers the 'CY_BLE_EVT_PENDING_FLASH_WRITE' event.
* 
*  \param param: Pointer to peer device address, of type cy_stc_ble_bd_addr_t. If the device
*           address is set to 0, then all devices shall be removed from the trusted Whitelist.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_RemoveDeviceFromWhiteList
(
    cy_stc_ble_bd_addr_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GetWhiteList
***************************************************************************//**
* 
*  This function is used to get the Whitelist.
*  This is a blocking call. Hence no event will be generated.
* 
*  \param param: Pointer to store the baseaddress of Whitelist.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*
* Note : The Whitelist memory will be used by the stack. Hence the application 
*        should not modify the contents using the pointer provided by the stack.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetWhiteList(cy_stc_ble_white_list_retention_t const**param);


/******************************************************************************
* Function Name: Cy_BLE_isLLControlProcPending
***************************************************************************//**
*
* This function checks the Link Layer state for any pending real time
* control (LL_CHANNEL_MAP, LL_CONNECTION_UPDATE) procedure. When any such 
* procedure is pending in Link layer busy state, it is indicated by the Link Layer.
*
*  Completion operation triggers 'CY_BLE_EVT_LL_CNTRL_PROC_PENDING_COMPLETE' event
*
* Applications using specific GAP APIs or L2CAP API that can result
* in initiation of real-time procedures such as LL_CHANNEL_MAP or LL_CONNECTION_UPDATE
* can check the state of the Link Layer to avoid any such rejection from the BLE Stack.
*
* The BLE Stack can reject the new request 
*
* \param param: Peer device handle.
*
* \return
* cy_en_ble_api_result_t: Return value indicates the Link Layer status for any pending
* real time procedure.
*
*  Errors codes                          | Description
*  -------------                         | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY         | Device identified by bdHandle is not present
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_isLLControlProcPending
(
    uint8_t   param
);


