ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_RegisterHciCb
***************************************************************************//**
* 
*  This API will initialize the HCI layer of the BLE Host Stack and will register Rx callback for all hci events and data. 
*  This API must be called before calling Cy_BLE_HciTransmit. 
*  This API should not be called during normal stack operation. 
*  If an application randomly uses hci APIs along with other APIs, behavior will be unpredictable.  
*
*  \param param: parameter is of type 'cy_ble_hci_rx_cb_t', callback function for Rx packets
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_RegisterHciCb
(
    cy_ble_hci_rx_cb_t     param
);


/******************************************************************************
* Function Name: Cy_BLE_HciShutdown
***************************************************************************//**
*  This function stops any ongoing operation on the BLE Stack and forces the BLE Host HCI and 
*  the BLE controller to shut down. The only functions that can be called after calling this
*  function is Cy_BLE_StackInit or Cy_BLE_RegisterHciCb. On calling one of these functions, the BLE Radio is turned 
*  off.
* 
*  No event is generated on calling this function.
* 
* \return
*  None
* 
******************************************************************************/
void Cy_BLE_HciShutdown
(
    void
);

/******************************************************************************
* Function Name: Cy_BLE_HciTransmit
***************************************************************************//**
* 
*  The application must use this API for sending packets. This API
*   must be called after calling 'Cy_BLE_RegisterHciCb'.
* 
*  \param param: parameter is of type 'cy_stc_ble_hci_tx_packet_info_t'
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HciTransmit
(
    cy_stc_ble_hci_tx_packet_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_SetPhy
***************************************************************************//**
*
* This API allows application to Sets the PHY for the current connection. 
* This is a non-blocking function and successful set to controller operation is 
* informed through 'CY_BLE_EVT_SET_PHY_COMPLETE'.
* Actual Phy used by controller will be informed through the 'CY_BLE_EVT_PHY_UPDATE_COMPLETE' event.
*
*  \param param: parameter is of type 'cy_stc_ble_set_phy_info_t'.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY         | Device identified by bdHandle is not present
*  CY_BLE_ERROR_INVALID_PARAMETER        | Null pointer passed.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetPhy
(
    const cy_stc_ble_set_phy_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_SetDefaultPhy
***************************************************************************//**
*
* This API allows the application to set a default PHY for all connections.
* This is a non-blocking function. Successful setting of the controller operation is 
* informed through 'CY_BLE_EVT_SET_DEFAULT_PHY_COMPLETE'.
* The actual Phy used by the controller will be informed through the 'CY_BLE_EVT_PHY_UPDATE_COMPLETE' event.
*
*  \param param: parameter is of type 'cy_stc_ble_set_suggested_phy_info_t'.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | Null pointer.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetDefaultPhy
(
    const cy_stc_ble_set_suggested_phy_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GetPhy
***************************************************************************//**
*
* This API allows the application to read the current PHY for the current connection.
*
* This is a non-blocking function. 
* Current Phy for Tx and Rx is informed through 'CY_BLE_EVT_GET_PHY_COMPLETE'
*
*  \param param: Peer bdHandle
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY         | Device identified by bdHandle is not present.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetPhy
(
    uint8_t       param
);

