ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_host_main.h
/******************************************************************************
* Function Name: Cy_BLE_GetTemperature
***************************************************************************//**
*
* This API allows the application to read the current temperature from the temperature
* sensor in the BLE radio.
*
* This is a non-blocking function. 
* Temperature value is informed through 'CY_BLE_EVT_RADIO_TEMPERATURE' in degreeC units
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetTemperature
(
    void
);

/******************************************************************************
* Function Name: Cy_BLE_GetBatteryLevel
***************************************************************************//**
*
* This API allows the application to read the current supply voltage of the BLE radio.
*
* This is a non-blocking function. 
* Voltage value is informed through 'CY_BLE_EVT_RADIO_VOLTAGE_LEVEL' in milliVolts.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetBatteryLevel
(
    void
);

#ifdef __cplusplus
}
#endif /* __cplusplus */
/** @} */

#endif /* CY_BLE_STACK_HOST_MAIN_H_ */


/*EOF*/
